# ThermalResistance Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisMaterial..::..ThermalResistance Property
EnergyAnalysisMaterial Class See Also
---
The thermal resistance (R-value) of the material.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public double ThermalResistance { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ThermalResistance As Double
	Get
```

Visual C++
---
```text
public:
property double ThermalResistance {
	double get ();
}
```

# See Also
EnergyAnalysisMaterial Class
Autodesk.Revit.DB.Analysis Namespace